[
  {
    "date": "2026-01-06",
    "riddle": "I hitch a ride on the dog, destroy your vacuum, and end up in your bedsheets. You can't win. What am I?",
    "answer": "dog hair"
  },
  {
    "date": "2026-01-07",
    "riddle": "I invade your car, destroy your hardwood floors, and crunch between your teeth when you try to eat outside.",
    "answer": "sand"
  },
  {
    "date": "2026-01-08",
    "riddle": "I scream at sunrise, steal your overpriced lunch, and paint your windshield white the second you wash it.",
    "answer": "seagull"
  },
  {
    "date": "2026-01-09",
    "riddle": "I colonize your hull, kill your gas mileage, and force you to scrape until your shoulders burn.",
    "answer": "barnacles"
  },
  {
    "date": "2026-01-10",
    "riddle": "I am invisible, I laugh at your expensive porch screens, and I eat you alive the moment the wind dies.",
    "answer": "no see ums"
  },
  {
    "date": "2026-01-11",
    "riddle": "see ums  I slam your car door on your shin, steal your hat, and throw your patio furniture into the canal. What am I?",
    "answer": "the wind"
  },
  {
    "date": "2026-01-12",
    "riddle": "I smell like mildew, squeeze you until you're breathless, and turn bathroom breaks into a logistical nightmare.",
    "answer": "wetsuit"
  },
  {
    "date": "2026-01-13",
    "riddle": "I scream like a chainsaw, disregard wake zones, buzz your bulkhead, and ruin your fishing spot every weekend.",
    "answer": "jet ski"
  },
  {
    "date": "2026-01-14",
    "riddle": "I lurk in the sound, strangle your propeller, and force you to go swimming with a knife. What am I?",
    "answer": "kelp"
  },
  {
    "date": "2026-01-15",
    "riddle": "I swell your front door shut, turn your leather shoes green, and ensure your towel never truly dries.",
    "answer": "humidity"
  },
  {
    "date": "2026-01-16",
    "riddle": "I ignore your spray, bite a chunk out of your leg, and swarm the second the breeze stops. Who am I?",
    "answer": "greenhead fly"
  },
  {
    "date": "2026-01-17",
    "riddle": "I hide in the shallows, wait for your foot, and spike your ankle if you forget to shuffle.",
    "answer": "stingray"
  },
  {
    "date": "2026-01-17",
    "riddle": "I hide in the grass, shank your bare foot, and force you to carry your limping dog home.",
    "answer": "sandspur"
  },
  {
    "date": "2026-01-18",
    "riddle": "I’m tattered, turned pink, and stubbornly flapping on a piling, refusing to admit the calendar says January. What am I?",
    "answer": "faded Trump flag"
  }
]